In [1]:
anime_csv = '../anime/anime.csv'

In [2]:
pd.read_csv(anime_csv)

NameError: name 'pd' is not defined

In [3]:
import pandas as pd

In [4]:
pd.read_csv(anime_csv)

,anime_id,name,genre,type,episodes,rating,members
0,32281,Kimi no Na wa.,"Drama, Romance, School, Supernatural",Movie,1,9.37,200630
1,5114,Fullmetal Alchemist: Brotherhood,"Action, Adventure, Drama, Fantasy, Magic, Mili...",TV,64,9.26,793665
2,28977,Gintama°,"Action, Comedy, Historical, Parody, Samurai, S...",TV,51,9.25,114262
3,9253,Steins;Gate,"Sci-Fi, Thriller",TV,24,9.17,673572
4,9969,Gintama&#039;,"Action, Comedy, Historical, Parody, Samurai, S...",TV,51,9.16,151266
...,...,...,...,...,...,...,...
10481,34471,Youkai Watch Movie 4,"Comedy, Kids, Supernatural",Movie,1,NaN,169
10482,34284,Yuuki Yuuna wa Yuusha de Aru: Washio Sumi no Shou,"Drama, Fantasy, Magic, Slice of Life",TV,6,NaN,2593
10483,34445,Yuuki Yuuna wa Yuusha de Aru: Yuusha no Shou,"Drama, Fantasy, Magic, Slice of Life",TV,6,NaN,4439
10484,33035,Yuyushiki Special,NaN,Special,1,NaN,2294
10485,33390,Zunda Horizon,NaN,Movie,1,NaN,160

In [5]:
anime_master_csv = '../anime/anime_master.csv'

In [7]:
pd.read_csv(anime_master_csv).head()

,anime_id,name,genre,type,episodes,rating,members
0,32281,Kimi no Na wa.,"Drama, Romance, School, Supernatural",Movie,1,9.37,200630
1,5114,Fullmetal Alchemist: Brotherhood,"Action, Adventure, Drama, Fantasy, Magic, Mili...",TV,64,9.26,793665
2,28977,Gintama°,"Action, Comedy, Historical, Parody, Samurai, S...",TV,51,9.25,114262
3,9253,Steins;Gate,"Sci-Fi, Thriller",TV,24,9.17,673572
4,9969,Gintama',"Action, Comedy, Historical, Parody, Samurai, S...",TV,51,9.16,151266

In [8]:
ser = pd.Series([1,2,3],index=['a','b','c'])

In [9]:
ser

a    1
b    2
c    3
dtype: int64

In [11]:
ser.loc['b']

2

In [12]:
ser != 2

a     True
b    False
c     True
dtype: bool

In [14]:
df = pd.DataFrame([[1,10,100],[2,20,200],[3,30,300]],index =['r1','r2','r3'],columns=['c1','c2','c3'])

In [15]:
df

    c1  c2   c3
r1   1  10  100
r2   2  20  200
r3   3  30  300

In [17]:
df['c1']

r1    1
r2    2
r3    3
Name: c1, dtype: int64

In [19]:
df.loc['r1']

c1      1
c2     10
c3    100
Name: r1, dtype: int64

In [20]:
df1 = pd.DataFrame([[1,10,100],[2,20,200],[3,30,300]],columns=['c1','c2','c3'])

In [21]:
df1

   c1  c2   c3
0   1  10  100
1   2  20  200
2   3  30  300

In [22]:
df1 = pd.DataFrame([[1,10,100],[2,20,200],[3,30,300]])

In [23]:
df1

   0   1    2
0  1  10  100
1  2  20  200
2  3  30  300

In [24]:
df1[1][1]

20